import { About, Project, Job, Tender } from '../models/About';
import mnbLogo from '../assets/images/logo.png';

export const ABOUT = [
    new About(
        'ҮНДЭСНИЙ ТЕЛЕВИЗ',
        mnbLogo,
        'МҮОНТ нь үзэгчиддээ зориулан 1. 2-р суваг тус бүр 1 хоногт 17 цаг, нийт 12400 цагийн нэвтрүүлэг бэлтгэн дамжуулж байна. МҮОНТ нийгмийн бүх давхаргад нөлөөлөхүйц хүүхэд залуучууд , боловсрол, уламжлалт ёс заншил, эрүүл мэндийн чиглэлээр нэвтрүүлэг бэлтгэдэг уламжлалаа хадгалан, мэдээ мэдээлэл, хүүхэд сургалт, танин мэдэхүй, нийгмийн чанартай нэвтрүүлгүүдийн цагийг түлхүү нэмэгдүүлж, нийгмийн болон үндэстний цөөнх бүлгүүдийн эрх ашгийг харгалзах замаар бүтэц, зохион байгуулалт, нэвтрүүлгийн бодлогоо боловсронгүй болгох, цогц өөрчлөлтүүдийг хийж байна.'
    ),
    new About(
        'МОНГОЛЫН МЭДЭЭ',
        mnbLogo,
        'МҮОНРадио нь Монголын Радио, Монголын дуу хоолой, Р3 радио гэсэн 3 сувагтай. МҮОНРадио 3 сувгаар өдөрт 38 цагийн, жилдээ 13,870 цагийн программ бэлтгэн дамжуулдаг. Монголын радио суваг нь 06:00-23:00 цагийн хооронд нийт 17 цаг, Монголын дуу хоолой суваг 17:30, 22:00 цагуудад 30 минутаар тус бүр 5 хэлээр 5 цаг, РЗ радио суваг нь 07:00-23:00 цагийн хооронд нийт 16 цагийн хөтөлбөрийг өдөр бүр бэлтгэн сонсогчиддоо хүргэж байна.'
    ),
    new About(
        'MNB СПОРТ',
        mnbLogo,
        'МҮОНРадио нь Монголын Радио, Монголын дуу хоолой, Р3 радио гэсэн 3 сувагтай. МҮОНРадио 3 сувгаар өдөрт 38 цагийн, жилдээ 13,870 цагийн программ бэлтгэн дамжуулдаг. Монголын радио суваг нь 06:00-23:00 цагийн хооронд нийт 17 цаг, Монголын дуу хоолой суваг 17:30, 22:00 цагуудад 30 минутаар тус бүр 5 хэлээр 5 цаг, РЗ радио суваг нь 07:00-23:00 цагийн хооронд нийт 16 цагийн хөтөлбөрийг өдөр бүр бэлтгэн сонсогчиддоо хүргэж байна.'
    ),
    new About(
        'MNB WORLD',
        mnbLogo,
        'МҮОНРадио нь Монголын Радио, Монголын дуу хоолой, Р3 радио гэсэн 3 сувагтай. МҮОНРадио 3 сувгаар өдөрт 38 цагийн, жилдээ 13,870 цагийн программ бэлтгэн дамжуулдаг. Монголын радио суваг нь 06:00-23:00 цагийн хооронд нийт 17 цаг, Монголын дуу хоолой суваг 17:30, 22:00 цагуудад 30 минутаар тус бүр 5 хэлээр 5 цаг, РЗ радио суваг нь 07:00-23:00 цагийн хооронд нийт 16 цагийн хөтөлбөрийг өдөр бүр бэлтгэн сонсогчиддоо хүргэж байна.'
    ),
    new About(
        'МОНГОЛЫН РАДИО',
        mnbLogo,
        'МҮОНРадио нь Монголын Радио, Монголын дуу хоолой, Р3 радио гэсэн 3 сувагтай. МҮОНРадио 3 сувгаар өдөрт 38 цагийн, жилдээ 13,870 цагийн программ бэлтгэн дамжуулдаг. Монголын радио суваг нь 06:00-23:00 цагийн хооронд нийт 17 цаг, Монголын дуу хоолой суваг 17:30, 22:00 цагуудад 30 минутаар тус бүр 5 хэлээр 5 цаг, РЗ радио суваг нь 07:00-23:00 цагийн хооронд нийт 16 цагийн хөтөлбөрийг өдөр бүр бэлтгэн сонсогчиддоо хүргэж байна.'
    ),
    new About(
        'P3 FM 100.9',
        mnbLogo,
        'МҮОНРадио нь Монголын Радио, Монголын дуу хоолой, Р3 радио гэсэн 3 сувагтай. МҮОНРадио 3 сувгаар өдөрт 38 цагийн, жилдээ 13,870 цагийн программ бэлтгэн дамжуулдаг. Монголын радио суваг нь 06:00-23:00 цагийн хооронд нийт 17 цаг, Монголын дуу хоолой суваг 17:30, 22:00 цагуудад 30 минутаар тус бүр 5 хэлээр 5 цаг, РЗ радио суваг нь 07:00-23:00 цагийн хооронд нийт 16 цагийн хөтөлбөрийг өдөр бүр бэлтгэн сонсогчиддоо хүргэж байна.'
    ),
    new About(
        'МОНГОЛЫН РАДИО - 85',
        mnbLogo,
        'МҮОНРадио нь Монголын Радио, Монголын дуу хоолой, Р3 радио гэсэн 3 сувагтай. МҮОНРадио 3 сувгаар өдөрт 38 цагийн, жилдээ 13,870 цагийн программ бэлтгэн дамжуулдаг. Монголын радио суваг нь 06:00-23:00 цагийн хооронд нийт 17 цаг, Монголын дуу хоолой суваг 17:30, 22:00 цагуудад 30 минутаар тус бүр 5 хэлээр 5 цаг, РЗ радио суваг нь 07:00-23:00 цагийн хооронд нийт 16 цагийн хөтөлбөрийг өдөр бүр бэлтгэн сонсогчиддоо хүргэж байна.'
    )
];

export const PROJECTS = [
    new Project(
        'ЗАЛУУ ЗОХИОН БҮТЭЭГЧ',
        'http://zzb.mnb.mn/images/logo.png',
        '"Дараах зорилгуудын аль нэг зорилгод нийцсэн техникийн шийдэл"-ийн санаа гаргасан, боловсруулсан техник, бүтээлч сэтгэхүйтэй 12-28 насны хүүхэд, залуус багаа бүрдүүлэн уралдаанд оролцоно. Үүнд: Хүний үйл ажиллагааг хөнгөвчилсөн, Хүүхдийн эрүүл, аюулгүй орчинд эсэн мэнд амьдрах, сурч боловсроход чиглэсэн, Байгалийн нөөцийн үр ашигтай, зохистой хэрэглээг дэмжсэн, байгаль орчны бохирдол, доройтлоос урьдчилан сэргийлсэн',
        'http://zzb.mnb.mn/'
    ),
    new Project(
        'ЗАЛУУ ЗОХИОН БҮТЭЭГЧ',
        'http://zzb.mnb.mn/images/logo.png',
        '"Дараах зорилгуудын аль нэг зорилгод нийцсэн техникийн шийдэл"-ийн санаа гаргасан, боловсруулсан техник, бүтээлч сэтгэхүйтэй 12-28 насны хүүхэд, залуус багаа бүрдүүлэн уралдаанд оролцоно. Үүнд: Хүний үйл ажиллагааг хөнгөвчилсөн, Хүүхдийн эрүүл, аюулгүй орчинд эсэн мэнд амьдрах, сурч боловсроход чиглэсэн, Байгалийн нөөцийн үр ашигтай, зохистой хэрэглээг дэмжсэн, байгаль орчны бохирдол, доройтлоос урьдчилан сэргийлсэн',
        'http://zzb.mnb.mn/'
    )
];

// this.title = title;
// this.undsenChigUureg = undsenChigUureg;
// this.shaardlaguud = shaardlaguud;
// this.nemeltMedeelel = nemeltMedeelel;
// this.contactInfo = contactInfo;
// this.anketTemplateUrl = anketTemplateUrl;

export const JOBS = [
    new Job(
        'МҮОНТ-д сэтгүүлч сонгон шалгаруулж авна',
        'Монголын Үндэсний Олон Нийтийн Телевизийн Соёл урлагийн нэвтрүүлгийн редакцид сэтгүүлч сонгон шалгаруулж авна. Гүйцэтгэх үндсэн үүрэг: Ажлын байрны тодорхойлолтонд заасан ажил үүргийг гүйцэтгэнэ.',
        '1. Сэтгүүл зүй мэргэжлээр их, дээд сургууль төгссөн 2. Багаар ажиллаж, ачаалал даах чадвартай, харилцааны соёлтой 3. Ажлын болон хувийн зохион байгуулалт сайтай, хариуцлага хүлээх чадвартай 4. Эфирийн зөв төрхтэй 5. Тогтвор суурьшилтай ажиллах хүсэлтэй',
        '1. Дэлгэрэнгүй анкет /mnb.mn сайтын “Бусад” гэсэн хэсэгт буй МҮОНРТ-ийн ажилтны анкетыг бөглөх/ 2. Их, дээд сургууль төгссөн диплом болон бусад материалын хуулбар Сонгон шалгаруулалтад оролцохыг хүсэгчид 2019 оны 11 дүгээр сарын 21-ний өдрөөс 28-ны өдрийн 17:00 цаг хүртэл хугацаанд доорхи хаягаар ирүүлнэ үү.',
        'Хаяг: Монгол улс, Улаанбаатар хот, Баянгол дүүрэг, 11 дүгээр хороо, Хувьсгалын зам-3, Монголын Үндэсний Олон Нийтийн Радио Телевиз Утасны дугаар: 11325802 Цахим хаяг: mnb.hrcs@gmail.com',
        'http://www.mnb.mn/uploads/job/6a78a91689966bf4c8f51cf4d142bff727c95657.doc'
    ),
    new Job(
        'МҮОНТ-д зураглаач сонгон шалгаруулж авна',
        '1. Зураглаач мэргэжлээр их, дээд сургууль төгссөн 2. Багаар ажиллаж, ачаалал даах чадвартай, харилцааны соёлтой 3. Ажлын болон хувийн зохион байгуулалт сайтай, хариуцлага хүлээх чадвартай 4. Тогтвор суурьшилтай ажиллах хүсэлтэй 5. Дижитал, аналог, хальсны зэрэг бүх төрлийн камер, камерын кран, тэргэнцэр зэрэг дагалдах техник дээр ажиллах чадвартай',
        '• Дэлгэрэнгүй анкет /mnb.mn сайтын “Бусад” гэсэн хэсэгт буй МҮОНРТ-ийн ажилтны анкетыг бөглөх/ • Их, дээд сургууль төгссөн диплом болон бусад материалын хуулбар Сонгон шалгаруулалтад оролцохыг хүсэгчид 2019 оны 11 дүгээр сарын 21-ний өдрөөс 28-ны өдрийн 17:00 цаг хүртэл хугацаанд доорх хаягаар ирүүлнэ үү.',
        'Хаяг: Монгол улс, Улаанбаатар хот, Баянгол дүүрэг, 11 дүгээр хороо, Хувьсгалын зам-3, Монголын Үндэсний Олон Нийтийн Радио Телевиз Утасны дугаар: 11325802 Цахим хаяг: mnb.hrcs@gmail.com',
        'http://www.mnb.mn/uploads/job/55c4f6a3246677bf666e0bf77a54cb9377f3f604.doc'
    )
];

// this.title = title;
// this.tenderName = tenderName;
// this.zarlasanOgnoo = zarlasanOgnoo;
// this.duusahOgnoo = duusahOgnoo;
// this.tenderDescription = tenderDescription;
// this.contactInfo = contactInfo;
// this.materialuud = materialuud;

export const TENDERS = [
    new Tender(
        'МҮОНРТ-д “Ажилтан албан хаагчдын хөгжлийн хөтөлбөр хэрэгжүүлэх” зөвлөх үйлчилгээний гүйцэтгэгчийг сонгон шалгаруулна',
        'МҮОНРТ-д  “Ажилтан албан хаагчдын хөгжлийн хөтөлбөр хэрэгжүүлэх” зөвлөх үйлчилгээний гүйцэтгэгчийн сонгон шалгаруулалт',
        '2019.10.10',
        '2019.10.30, 16:00 цаг',
        'МҮОНРТ-ийн хүний нөөцийн бодлогын бичиг баримтын шинэчлэлтэй холбогдуулан “Ажилтан албан хаагчдын хөгжлийн хөтөлбөр хэрэгжүүлэх” зөвлөх үйлчилгээний гүйцэтгэгчийг сонгон шалгаруулах тул оролцох эрх бүхий аж ахуйн нэгж, албан байгууллагыг саналаа ирүүлэхийг урьж байна.',
        'БГД, 11 дүгээр хороо Хувьсгалын зам-3 МҮОНРТ-ийн байр 4-р давхар Утас: 70117004,  91919360 Цахим хаяг: www.mnb.mn',
        'http://www.mnb.mn/j/235'
    ),
    new Tender(
        'Эвлүүлгийн компьютер, дэлгэц нийлүүлэх үнийн саналаа ирүүлнэ үү',
        'Эвлүүлгийн компьютер, дэлгэц нийлүүлэх',
        '2019.10.10',
        '2019.10.30, 16:00 цаг',
        'МҮОНРТ нь сонгогдсон эрх бүхий тендерт оролцогчдоос “Монголын мэдээ” сувагт эвлүүлгийн компьютер, дэлгэц нийлүүлэх  үнийн санал ирүүлэхийг урьж байна.',
        'Материалыг 2019 оны 12 дугаар сарын 13 өдрийн 11.00 цагаас өмнө УБ хот,Баянгол дүүрэг 11-р хороо,Хувьсгалчдын зам МҮОНРТ-ийн төв байр, 1-19 тоот өрөө,Б.Насанжаргал Утас: 80035558 хаягаар ирүүлнэ.',
        'http://www.mnb.mn/j/235'
    )
];