import Medee from '../models/Medee';

const MEDEE = [
    new Medee(
        '"Шинэ банк байгуулах асуудлыг хэлэлцсэн. Монголбанкнаас шийдвэр гараагүй байна"',
        'Монголбанкнаас ил тод байдлын хүрээнд зохион байгуулдаг сар тутмын хэвлэлийн хурлыг өнөөдөр хийсэн билээ. Энэ үеэр Монголбанкны удирдлагуудын зүгээс цаг үеийн асуудлаар сэтгүүлчдийн асуултад хариулт өгснийг хүргэе.',
        'https://content.ikon.mn/news/2019/11/28/e6cd19_MPA_PHOTO_2019-8433_x974.jpg',
        'Онцлох мэдээ'
    ),
    new Medee(
        'Элчин сайд Т.Төгсбилгүүн Тайландын Үндэсний Ассамблейн даргад бараалхав',
        'Монгол Улсаас Тайландын Хаант Улсад суугаа Элчин сайд Т.Төгсбилгүүн Тайландын Үндэсний Ассамблейн дарга бөгөөд Төлөөлөгчдийн танхимын спикер Чуан Лийкпай-д 2019 оны 11 дүгээр сарын 26-ны өдөр Бангкок хот дахь Парламентын ордонд бараалхав.',
        'https://content.ikon.mn/news/2019/11/28/9af8be_1-1024x683_x974.jpg',
        'Нийгэм'        
    ),
    new Medee(
        'Криштиано Рональдо түүхэн амжилт тогтооход нэг алхам дутуу байна',
        'Хөлбөмбөгийн супер од Криштиано Рональдо өчигдөр Португалийн шигшээ багт тоглохдоо 99 дэх гоолоо хийлээ.',
        'https://content.ikon.mn/news/2019/11/18/90c529_ronaldo_99th_goal_x974.jpg',
        'Спорт'
    ),
    new Medee(
        'Засгийн газраас гаргасан шийдвэрүүд',
        'Засгийн газраас “Ахуйн үйлчилгээний салбарыг хөгжүүлэх үндэсний хөтөлбөр”-ийг өнөөдөр/2019.11.28/ баталсан байна',
        'https://content.ikon.mn/news/2019/2/20/a3fb01_MPA_PHOTO_2017-8251_x974.jpg',
        'Эдийн засаг'
    )
];

export default MEDEE;